In [86]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import re

In [87]:
# import data from the data sources.
folder_path = "assignment-datasets/"
df = pd.read_csv(folder_path + "Stock_File_1.csv")
df2 = pd.read_csv(folder_path + "Stock_File_2.txt")

In [88]:
df.head()

        Date    Open    High    Low   Close Volume
0   1-Jun-06  471.60  474.00  442.0  444.42  21900
1  12-Jun-06  454.00  464.00  440.0  446.17   8400
2  22-Jun-06  451.16  464.20  447.6  460.26  19400
3   3-Jul-06  495.10  509.68  493.0  498.97   9100
4  13-Jul-06  518.00  526.40  517.0  521.66   6800

In [89]:
df2.head()

        Date   Open    High     Low   Close Volume
0   3-Jan-11  798.0  824.95  796.00  810.55  17600
1  13-Jan-11  748.1  768.00     NaN  752.85  13000
2  24-Jan-11  741.0  626.01  732.55     NaN   8700
3   1-Feb-11  753.0  753.00  712.10  717.25  23700
4  11-Feb-11  647.9  654.55  626.35  642.40  12800

In [90]:
# check for null values in both the data frames.
null_count_1 = df.isnull().sum()
null_count_2 = df2.isnull().sum()
print(
    f"""
    {null_count_1}
    {null_count_2}
    """
)

    Date      0
Open      4
High      7
Low       6
Close     7
Volume    0
dtype: int64
    Date      0
Open      3
High      9
Low       7
Close     7
Volume    0
dtype: int64

In [91]:
# concat the two data frames.
df_concat = pd.concat([df, df2], axis=0)
df_concat.head()

        Date    Open    High    Low   Close Volume
0   1-Jun-06  471.60  474.00  442.0  444.42  21900
1  12-Jun-06  454.00  464.00  440.0  446.17   8400
2  22-Jun-06  451.16  464.20  447.6  460.26  19400
3   3-Jul-06  495.10  509.68  493.0  498.97   9100
4  13-Jul-06  518.00  526.40  517.0  521.66   6800

In [92]:
df_concat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 369 entries, 0 to 203
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    369 non-null    object
 1   Open    362 non-null    float64
 2   High    353 non-null    float64
 3   Low     356 non-null    float64
 4   Close   355 non-null    float64
 5   Volume  369 non-null    object
dtypes: float64(4), object(2)
memory usage: 20.2+ KB

In [93]:
# Fill the null values in the high Column with the mean of the High Column.
df_concat["High"].fillna(df_concat["High"].mean(), inplace=True)
# Fill the null values in the Low Column with the mean of the Low Column.
df_concat["Low"].fillna(df_concat["Low"].mean(), inplace=True)
# Fill the null values in the Close Column with the mean of the Close Column.
df_concat["Close"].fillna(df_concat["Close"].mean(), inplace=True)
# Fill the null values in the Open Column with the mean of the Open Column.
df_concat["Open"].fillna(df_concat["Open"].mean(), inplace=True)
# check if null values exists.
df_concat.isnull().sum()

Date      0
Open      0
High      0
Low       0
Close     0
Volume    0
dtype: int64

In [94]:
df_concat[df_concat["Volume"] == "zero"]

          Date     Open     High      Low    Close Volume
103  10-Apr-09   458.75   458.75   458.75   458.75   zero
105   1-May-09  1447.35   487.35   487.35   487.35   zero
119  21-Sep-09  1755.80   795.80   795.80   795.80   zero
123   2-Nov-09  1727.85   767.85   767.85   767.85   zero
129   1-Jan-10   767.25   767.25   767.25   767.25   zero
48    1-May-12  1778.00   818.00   818.00   818.00   zero
84    1-May-13   519.55   519.55   519.55   519.55   zero
120   1-May-14  1800.45   840.45   840.45   840.45   zero
156   1-May-15  2291.95  1331.95  1331.95  1331.95   zero
173  22-Oct-15  1237.75  1237.75  1237.75  1237.75   zero
175  12-Nov-15  1201.70  1201.70  1201.70  1201.70   zero

In [95]:
# Clean Values in Volume Column.

# Find the rows in Volume column where the value is "zero"
df_concat['Volume'].replace('zero', 0, inplace=True)

In [96]:
df_concat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 369 entries, 0 to 203
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    369 non-null    object
 1   Open    369 non-null    float64
 2   High    369 non-null    float64
 3   Low     369 non-null    float64
 4   Close   369 non-null    float64
 5   Volume  369 non-null    object
dtypes: float64(4), object(2)
memory usage: 20.2+ KB

In [97]:
# Convert the dtype of Volume column from object to Float
df_concat["Volume"] = df_concat["Volume"].astype(float)
df_concat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 369 entries, 0 to 203
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    369 non-null    object
 1   Open    369 non-null    float64
 2   High    369 non-null    float64
 3   Low     369 non-null    float64
 4   Close   369 non-null    float64
 5   Volume  369 non-null    float64
dtypes: float64(5), object(1)
memory usage: 20.2+ KB

In [98]:
# check for rows where the High value is greater than the Low value.
print(len(df_concat[df_concat["Low"] > df_concat["High"]]))
df_concat[df_concat["Low"] > df_concat["High"]]

35

          Date     Open        High          Low        Close    Volume
12    3-Oct-06   591.00  592.000000   856.357472   585.960000    6200.0
14   23-Oct-06   674.14  667.000000   674.140000   704.450000   65700.0
24    1-Feb-07   729.80  551.020000   722.800000   760.550000   49700.0
32   23-Apr-07   780.00  642.000000   772.000000   781.630000   35400.0
45    3-Sep-07  1131.00  493.000000  1131.000000  1172.400000  165800.0
52   12-Nov-07  1575.00  644.000000  1500.000000  1548.000000   35500.0
53   22-Nov-07  1550.00  709.600000  1453.000000  1525.000000   30500.0
54    3-Dec-07  1580.00  387.600000  1558.000000  1602.950000  135000.0
73   12-Jun-08   980.00  858.892918   945.000000   963.300000   43000.0
86   21-Oct-08   651.00  678.000000   856.357472   673.050000   51700.0
114   3-Aug-09   705.00  728.000000   856.357472   724.250000  110400.0
117   1-Sep-09   759.50  519.000000   735.000000   867.098817   47700.0
122  21-Oct-09   808.00  517.000000   803.000000   814.350000   94700.0
126   1-Dec-09   739.10  747.000000   856.357472   743.450000   62700.0
130  11-Jan-10   803.00  480.670000   802.000000   820.600000  114500.0
143  24-May-10   830.10  830.100000   856.357472   829.100000   44600.0
153   1-Sep-10   785.00  411.000000   770.000000   777.900000    8900.0
156   1-Oct-10   910.00  858.892918   905.000000   925.650000   60300.0
1    13-Jan-11   748.10  768.000000   856.357472   752.850000   13000.0
2    24-Jan-11   741.00  626.010000   732.550000   867.098817    8700.0
25   12-Sep-11   840.00  664.000000   839.500000   850.550000    4300.0
33    1-Dec-11   619.00  621.900000   856.357472   605.000000   21200.0
44   22-Mar-12   827.45  585.400000   805.000000   813.750000   17900.0
62   24-Sep-12   770.05  440.800000   770.050000   783.450000   10200.0
78    1-Mar-13   573.00  583.100000   856.357472   574.400000    5700.0
90    1-Jul-13   611.50  432.000000   611.000000   621.350000   18700.0
119  21-Apr-14   845.25  846.850000   856.357472   833.750000   12800.0
133  11-Sep-14  1144.00  858.892918  1142.000000  1148.650000    8400.0
144   1-Jan-15  1285.00  858.892918  1272.000000  1299.850000   18100.0
163  10-Jul-15  1402.75  439.000000  1364.950000  1372.300000    4600.0
177   1-Dec-15  1180.00  858.892918  1174.800000  1176.950000    3900.0
188  21-Mar-16  1159.95  858.892918  1149.400000  1174.650000    4800.0
193  12-May-16  1280.00  366.200000  1275.000000  1281.100000    4200.0
201   1-Aug-16  1279.65  858.892918  1247.400000  1250.650000    4600.0
202  11-Aug-16  1180.05  683.000000  1171.150000  1191.350000    4800.0

In [99]:
# remove all the rows where the High value is greater than the Low value in df_concat
df_concat.drop(
    df_concat[df_concat["Low"] > df_concat["High"]].index, inplace=True
)
df_concat[df_concat["Low"] > df_concat["High"]]

Empty DataFrame
Columns: [Date, Open, High, Low, Close, Volume]
Index: []

In [100]:
df_concat.describe()

              Open         High          Low        Close         Volume
count   304.000000   304.000000   304.000000   304.000000     304.000000
mean    882.283429   883.440086   845.482236   859.993970   38523.684211
std     286.703267   273.894038   267.208456   266.346216   67786.172482
min     364.000000   366.000000   354.000000   363.600000       0.000000
25%     688.750000   695.950000   675.037500   684.325000    6800.000000
50%     814.925000   824.975000   789.500000   811.850000   16250.000000
75%    1101.287500  1114.000000  1050.000000  1064.962500   46300.000000
max    1800.450000  1650.000000  1600.050000  1607.850000  843600.000000

In [101]:
# export df_concat
df_concat.to_csv(folder_path + "Stock_File_concat_cleaned.csv", index=False)